quest_system_2081410435_name=^?^The Black Mark
quest_system_2081410435_stage_0=^?^Give the Black Mark to Lucky James, who is hiding in the mines.
quest_system_2081410435_stage_1=^?^The Mark has been delivered. Return to Redbeard.
quest_system_2081410435_stage_2=^?^Tell Redbeard that Lucky James is dead.
quest_system_2081410435_task=^?^Redbeard has asked you to give the Black Mark to the pirate, in exchange for the password to the mines of Lucky James.<br>[reward]
